Tekla Open API Reference for Tekla Structures 2025
PreferredPlacingTypes.LeaderLineAndParentObjectAlongPartPlacingType Method
 The object is placed with a leader line and rotated to be at the same angle as the connected part.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static PreferredPlacingTypeBase LeaderLineAndParentObjectAlongPartPlacingType()
Public Shared Function LeaderLineAndParentObjectAlongPartPlacingType As PreferredPlacingTypeBase
Return Value
Type: PreferredPlacingTypeBase
A new leader line and parent object along part placing type instance.
See Also
Reference
PreferredPlacingTypes Class
Tekla.Structures.Drawing Namespace